---
type: CableTraySizeIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 9
tags: [revit-api, class]
---

# CableTraySizeIterator

`Autodesk.Revit.DB.Electrical.CableTraySizeIterator` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2017 | `public MEPSize GetCurrent ()` |
| Method | HasCurrent | 2017 | `public bool HasCurrent ()` |
| Method | IsDone | 2017 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2017 | `public virtual bool MoveNext ()` |
| Method | Reset | 2017 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual MEPSize Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |